class window.Texts

  constructor:->
    @auth_window_title = "Выбор персонажа."
    @auth_window_title2 = "Добро пожаловать в лучший футбольный менеджер!<br/>Выбирите за кого вы будете играть."
    @next = "Далее"
    @need_choise = "Нужно кого-нибудь выбрать"
    @auth_window_description = "Быть ближе к игрокам или деньгам? Вот в чем вопрос!"

    @choice_base_career_window_title = "Выбор прошлого."
    @choice_base_career_window_title2 = "Выбирите кем был ваш персонаж в прошлом.<br/>От этого зависит бонусное умение и стиль управления командой."
    @choice_base_career_default_bonus = "- Бонусное умение персонажа."
    @choice_base_career_footballer_bonus = '- Умеет далеко выбить мяч в аут и крикнуть: "Вышли!"'
    @choice_base_career_thief_bonus = '- Умеет лепить фигурки богов из мякишей хлеба.'

    @free_teams_window_title = "Свободные команды."
    @free_teams_window_choice_club = "Выберите за какую команду Вы будете играть."
    @free_teams_window_title2 = "Выбирите кем был ваш персонаж в прошлом.<br/>От этого зависит бонусное умение и стиль управления командой."
    @need_choise_club = 'Нужно выбрать 1 команду'
    @free_teams_window_default_bonus = "- Бонусное умение персонажа."
    @free_teams_window_footballer_bonus = '- Умеет далеко выбить мяч в аут и крикнуть: "Вышли!"'
    @free_teams_window_thief_bonus = "- Умеет лепить фигурки богов из мякишей хлеба."
    @free_teams_window_create_new_team = "Создать новую команду"
    @free_teams_window_team_used = "Извините этот клуб уже заняли, выберите другой"
    @free_teams_window_login_used = "Извините этот логин уже заняли, нажмите еще раз далее, чтобы выбрать другой"

    @login_without_social_window_log_in = "Вход"
    @button_in = "Войти"
    @login_without_social_window_sign_in = "Регистрация"
    @button_ok = "Ок"
    @login= "Логин"
    @pass = "Пароль"
    @need_sign_in = "Если Вы еще не зарегестрированны, то для входа в игру Вам необходимо это сделать"
    @need_login_in = "Если Вы уже зарегестрированны, перейдите ко входу"
    @need_fill_input = "Поле нужно заполнить"
    @login_already_busy = "Логин уже занят"

    @club_name = "Клуб: "
    @dont_hired = "пока не нанят"
    @coach = "Тренер: "
    @director = "Директор: "
    @money = "Денег: "
    @last_match_text = "Последний матч:"
    @next_matches_text = "Будущие матчи:"


    @greetings_news_label = "Добро пожаловать!"
    @greetings_news_content = "<p>Привет! Отличный день для того чтобы провети его у экрана монитора:)</p><p>Спасибо Вам за то что выбрали именно нашу игру! Мы искренне хотели сделать настоящий, интересный футбольный менеджер - со всеми реалиями футбола (схемами, тактиками, договорняками, президентами федераций, травмами, болезнями, различными скандалами связанными с жизнью футболистов ну и прочими интерестностями).\nИ очень надеемся что у нас это получилось:)</p><p>Так как Вы находитесь на самом старте своей карьеры, Вы получаете в свое распоряжение футбольный клуб имеющий в своем распоряжении 21 футболиста. У них есть различные показатели: сила, форма, настроение, темперамент, различные специальные возможности и еще некоторые скрытые показатели, которые Вы сможете раскрыть в процессе расширения своей Базы, приглашения различных специалистов для работы с игроками и роста собственных навыков.</p><p>Предлагаем Вам самим полазить по различным менюшкам. Дать первые распоряжения. Главное! Не забудте выстовить состав на свою первую игру! Для более детального изучения механизмов игры Вы можете почитать \"Правила игры\" в нашей группе.</p><p>Желаем Вам разорвать соперника в пух и прах!!!:)</p><p>PS: Как то кровожадно получилось. Ну да ничего в игре Вас и не такое ждет;)</p>"
    @joke_label = "Шутка дутка дня"
    @joke_content = "<p>Пятиклассник Вахтанг требует затонировать окна в классе, а то \"как лохи сидим\"</p>"
    @news_window_title = "Новости"

    @news_hint = "Новости"
    @match_hint = "Отправить состав"



    @strength = "S"